Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.3.111/atdf/PIC32MZ1064DAG176.atdf
      <value-group caption="Analog Common Scan Select bits 11" name="ADCCSS1__CSS11">
         <value caption="Select ANx for input scan" name="" value="0x1" />
         <value caption="Skip ANx for input scan" name="" value="0x0" />
      </value-group>
      <value-group caption="Analog Common Scan Select bits 12" name="ADCCSS1__CSS12">
         <value caption="Select ANx for input scan" name="" value="0x1" />
         <value caption="Skip ANx for input scan" name="" value="0x0" />
      </value-group>
      <value-group caption="Analog Common Scan Select bits 13" name="ADCCSS1__CSS13">
         <value caption="Select ANx for input scan" name="" value="0x1" />
         <value caption="Skip ANx for input scan" name="" value="0x0" />
      </value-group>
      <value-group caption="Analog Common Scan Select bits 14" name="ADCCSS1__CSS14">
         <value caption="Select ANx for input scan" name="" value="0x1" />
         <value caption="Skip ANx for input scan" name="" value="0x0" />
      </value-group>
      <value-group caption="Analog Common Scan Select bits 15" name="ADCCSS1__CSS15">
         <value caption="Select ANx for input scan" name="" value="0x1" />
         <value caption="Skip ANx for input scan" name="" value="0x0" />
      </value-group>
      <value-group caption="Analog Common Scan Select bits 16" name="ADCCSS1__CSS16">
         <value caption="Select ANx for input scan" name="" value="0x1" />
         <value caption="Skip ANx for input scan" name="" value="0x0" />
      </value-group>
      <value-group caption="Analog Common Scan Select bits 17" name="ADCCSS1__CSS17">
         <value caption="Select ANx for input scan" name="" value="0x1" />
         <value caption="Skip ANx for input scan" name="" value="0x0" />
      </value-group>
      <value-group caption="Analog Common Scan Select bits 18" name="ADCCSS1__CSS18">
         <value caption="Select ANx for input scan" name="" value="0x1" />
         <value caption="Skip ANx for input scan" name="" value="0x0" />
      </value-group>
      <value-group caption="Analog Common Scan Select bits 19" name="ADCCSS1__CSS19">
         <value caption="Select ANx for input scan" name="" value="0x1" />
         <value caption="Skip ANx for input scan" name="" value="0x0" />
      </value-group>
      <value-group caption="Analog Common Scan Select bits 20" name="ADCCSS1__CSS20">
         <value caption="Select ANx for input scan" name="" value="0x1" />
         <value caption="Skip ANx for input scan" name="" value="0x0" />
      </value-group>
      <value-group caption="Analog Common Scan Select bits 21" name="ADCCSS1__CSS21">
         <value caption="Select ANx for input scan" name="" value="0x1" />
         <value caption="Skip ANx for input scan" name="" value="0x0" />
      </value-group>
      <value-group caption="Analog Common Scan Select bits 22" name="ADCCSS1__CSS22">
         <value caption="Select ANx for input scan" name="" value="0x1" />
         <value caption="Skip ANx for input scan" name="" value="0x0" />
      </value-group>
      <value-group caption="Analog Common Scan Select bits 23" name="ADCCSS1__CSS23">
         <value caption="Select ANx for input scan" name="" value="0x1" />
         <value caption="Skip ANx for input scan" name="" value="0x0" />
      </value-group>
      <value-group caption="Analog Common Scan Select bits 24" name="ADCCSS1__CSS24">
         <value caption="Select ANx for input scan" name="" value="0x1" />
         <value caption="Skip ANx for input scan" name="" value="0x0" />
      </value-group>
      <value-group caption="Analog Common Scan Select bits 25" name="ADCCSS1__CSS25">
         <value caption="Select ANx for input scan" name="" value="0x1" />
         <value caption="Skip ANx for input scan" name="" value="0x0" />
      </value-group>
      <value-group caption="Analog Common Scan Select bits 26" name="ADCCSS1__CSS26">
         <value caption="Select ANx for input scan" name="" value="0x1" />
         <value caption="Skip ANx for input scan" name="" value="0x0" />
      </value-group>
      <value-group caption="Analog Common Scan Select bits 27" name="ADCCSS1__CSS27">
         <value caption="Select ANx for input scan" name="" value="0x1" />
         <value caption="Skip ANx for input scan" name="" value="0x0" />
      </value-group>
      <value-group caption="Analog Common Scan Select bits 28" name="ADCCSS1__CSS28">
         <value caption="Select ANx for input scan" name="" value="0x1" />
         <value caption="Skip ANx for input scan" name="" value="0x0" />
      </value-group>
      <value-group caption="Analog Common Scan Select bits 29" name="ADCCSS1__CSS29">
         <value caption="Select ANx for input scan" name="" value="0x1" />
         <value caption="Skip ANx for input scan" name="" value="0x0" />
      </value-group>
      <value-group caption="Analog Common Scan Select bits 30" name="ADCCSS1__CSS30">
         <value caption="Select ANx for input scan" name="" value="0x1" />
         <value caption="Skip ANx for input scan" name="" value="0x0" />
      </value-group>
      <value-group caption="Analog Common Scan Select bits 31" name="ADCCSS1__CSS31">
         <value caption="Select ANx for input scan" name="" value="0x1" />
         <value caption="Skip ANx for input scan" name="" value="0x0" />
      </value-group>
      <value-group caption="Analog Common Scan Select bits 32" name="ADCCSS2__CSS32">
         <value caption="Select ANx for input scan" name="" value="0x1" />
         <value caption="Skip ANx for input scan" name="" value="0x0" />
      </value-group>      
      <value-group caption="Analog Common Scan Select bits 33" name="ADCCSS2__CSS33">
         <value caption="Select ANx for input scan" name="" value="0x1" />
         <value caption="Skip ANx for input scan" name="" value="0x0" />
      </value-group>
      <value-group caption="Analog Common Scan Select bits 34" name="ADCCSS2__CSS34">
         <value caption="Select ANx for input scan" name="" value="0x1" />
         <value caption="Skip ANx for input scan" name="" value="0x0" />
      </value-group>
