Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.3.111/atdf/PIC32MZ1064DAG176.atdf
         <register caption="" name="CNSTATG" offset="0x690" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNSTATG0" />
            <bitfield mask="0x00000002" name="CNSTATG1" />
            <bitfield mask="0x00000040" name="CNSTATG6" />
            <bitfield mask="0x00000080" name="CNSTATG7" />
            <bitfield mask="0x00000100" name="CNSTATG8" />
            <bitfield mask="0x00000200" name="CNSTATG9" />
            <bitfield mask="0x00001000" name="CNSTATG12" />
            <bitfield mask="0x00002000" name="CNSTATG13" />
            <bitfield mask="0x00004000" name="CNSTATG14" />
            <bitfield mask="0x00008000" name="CNSTATG15" />
         </register>
         <register caption="" name="CNSTATH" offset="0x790" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNSTATH0" />
            <bitfield mask="0x00000002" name="CNSTATH1" />
            <bitfield mask="0x00000004" name="CNSTATH2" />
            <bitfield mask="0x00000008" name="CNSTATH3" />
            <bitfield mask="0x00000010" name="CNSTATH4" />
            <bitfield mask="0x00000020" name="CNSTATH5" />
            <bitfield mask="0x00000040" name="CNSTATH6" />
            <bitfield mask="0x00000080" name="CNSTATH7" />
            <bitfield mask="0x00000100" name="CNSTATH8" />
            <bitfield mask="0x00000200" name="CNSTATH9" />
            <bitfield mask="0x00000400" name="CNSTATH10" />
            <bitfield mask="0x00000800" name="CNSTATH11" />
            <bitfield mask="0x00001000" name="CNSTATH12" />
            <bitfield mask="0x00002000" name="CNSTATH13" />
            <bitfield mask="0x00004000" name="CNSTATH14" />
            <bitfield mask="0x00008000" name="CNSTATH15" />
         </register>
         <register caption="" name="CNSTATJ" offset="0x890" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNSTATJ0" />
            <bitfield mask="0x00000002" name="CNSTATJ1" />
            <bitfield mask="0x00000004" name="CNSTATJ2" />
            <bitfield mask="0x00000008" name="CNSTATJ3" />
            <bitfield mask="0x00000010" name="CNSTATJ4" />
            <bitfield mask="0x00000020" name="CNSTATJ5" />
            <bitfield mask="0x00000040" name="CNSTATJ6" />
            <bitfield mask="0x00000080" name="CNSTATJ7" />
            <bitfield mask="0x00000100" name="CNSTATJ8" />
            <bitfield mask="0x00000200" name="CNSTATJ9" />
            <bitfield mask="0x00000400" name="CNSTATJ10" />
            <bitfield mask="0x00000800" name="CNSTATJ11" />
            <bitfield mask="0x00001000" name="CNSTATJ12" />
            <bitfield mask="0x00002000" name="CNSTATJ13" />
            <bitfield mask="0x00004000" name="CNSTATJ14" />
            <bitfield mask="0x00008000" name="CNSTATJ15" />
         </register>
         <register caption="" name="CNSTATK" offset="0x990" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNSTATK0" />
            <bitfield mask="0x00000002" name="CNSTATK1" />
            <bitfield mask="0x00000004" name="CNSTATK2" />
            <bitfield mask="0x00000008" name="CNSTATK3" />
            <bitfield mask="0x00000010" name="CNSTATK4" />
            <bitfield mask="0x00000020" name="CNSTATK5" />
            <bitfield mask="0x00000040" name="CNSTATK6" />
            <bitfield mask="0x00000080" name="CNSTATK7" />
         </register>
         <register caption="" name="CNNEA" offset="0xa0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNNEA0" />
            <bitfield mask="0x00000002" name="CNNEA1" />
            <bitfield mask="0x00000004" name="CNNEA2" />
            <bitfield mask="0x00000008" name="CNNEA3" />
            <bitfield mask="0x00000010" name="CNNEA4" />
            <bitfield mask="0x00000020" name="CNNEA5" />
            <bitfield mask="0x00000040" name="CNNEA6" />
            <bitfield mask="0x00000080" name="CNNEA7" />
            <bitfield mask="0x00000200" name="CNNEA9" />
            <bitfield mask="0x00000400" name="CNNEA10" />
            <bitfield mask="0x00004000" name="CNNEA14" />
            <bitfield mask="0x00008000" name="CNNEA15" />
         </register>
         <register caption="" name="CNNEB" offset="0x1a0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNNEB0" />
            <bitfield mask="0x00000002" name="CNNEB1" />
            <bitfield mask="0x00000004" name="CNNEB2" />
            <bitfield mask="0x00000008" name="CNNEB3" />
            <bitfield mask="0x00000010" name="CNNEB4" />
            <bitfield mask="0x00000020" name="CNNEB5" />
            <bitfield mask="0x00000040" name="CNNEB6" />
            <bitfield mask="0x00000080" name="CNNEB7" />
            <bitfield mask="0x00000100" name="CNNEB8" />
            <bitfield mask="0x00000200" name="CNNEB9" />
            <bitfield mask="0x00000400" name="CNNEB10" />
            <bitfield mask="0x00000800" name="CNNEB11" />
            <bitfield mask="0x00001000" name="CNNEB12" />
            <bitfield mask="0x00002000" name="CNNEB13" />
            <bitfield mask="0x00004000" name="CNNEB14" />
            <bitfield mask="0x00008000" name="CNNEB15" />
         </register>
         <register caption="" name="CNNEC" offset="0x2a0" rw="RW" size="4">
            <bitfield mask="0x00000002" name="CNNEC1" />
            <bitfield mask="0x00000004" name="CNNEC2" />
            <bitfield mask="0x00000008" name="CNNEC3" />
            <bitfield mask="0x00000010" name="CNNEC4" />
            <bitfield mask="0x00001000" name="CNNEC12" />
            <bitfield mask="0x00002000" name="CNNEC13" />
            <bitfield mask="0x00004000" name="CNNEC14" />
            <bitfield mask="0x00008000" name="CNNEC15" />
         </register>
         <register caption="" name="CNNED" offset="0x3a0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNNED0" />
            <bitfield mask="0x00000002" name="CNNED1" />
            <bitfield mask="0x00000004" name="CNNED2" />
            <bitfield mask="0x00000008" name="CNNED3" />
            <bitfield mask="0x00000010" name="CNNED4" />
            <bitfield mask="0x00000020" name="CNNED5" />
            <bitfield mask="0x00000040" name="CNNED6" />
            <bitfield mask="0x00000080" name="CNNED7" />
            <bitfield mask="0x00000200" name="CNNED9" />
            <bitfield mask="0x00000400" name="CNNED10" />
            <bitfield mask="0x00000800" name="CNNED11" />
            <bitfield mask="0x00001000" name="CNNED12" />
            <bitfield mask="0x00002000" name="CNNED13" />
            <bitfield mask="0x00004000" name="CNNED14" />
            <bitfield mask="0x00008000" name="CNNED15" />
         </register>
         <register caption="" name="CNNEE" offset="0x4a0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNNEE0" />
            <bitfield mask="0x00000002" name="CNNEE1" />
            <bitfield mask="0x00000004" name="CNNEE2" />
            <bitfield mask="0x00000008" name="CNNEE3" />
            <bitfield mask="0x00000010" name="CNNEE4" />
            <bitfield mask="0x00000020" name="CNNEE5" />
            <bitfield mask="0x00000040" name="CNNEE6" />
            <bitfield mask="0x00000080" name="CNNEE7" />
            <bitfield mask="0x00000100" name="CNNEE8" />
            <bitfield mask="0x00000200" name="CNNEE9" />
         </register>
