Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.3.111/atdf/PIC32MZ1064DAG176.atdf
      <value-group caption="Data CRC Error Interrupt Signal Enable bit" name="SDHCINTSEN__DCRCEISE">
         <value caption="Data CRC error signal is enabled" name="" value="0x1" />
         <value caption="Data CRC error signal is masked" name="" value="0x0" />
      </value-group>
      <value-group caption="Data End Bit Error Interrupt Signal Enable bit" name="SDHCINTSEN__DEBEISE">
         <value caption="Data end bit error signal is enabled" name="" value="0x1" />
         <value caption="Data end bit error signal is masked" name="" value="0x0" />
      </value-group>
      <value-group caption="Current-Limit Error Interrupt Signal Enable bit" name="SDHCINTSEN__CLEISE">
         <value caption="Current-limit error signal is enabled" name="" value="0x1" />
         <value caption="Current-limit error signal is masked" name="" value="0x0" />
      </value-group>
      <value-group caption="Auto CMD12 Error Interrupt Signal Enable bit" name="SDHCINTSEN__ACEISE">
         <value caption="Auto CMD12 error signal is enabled" name="" value="0x1" />
         <value caption="Auto CMD12 error signal is masked" name="" value="0x0" />
      </value-group>
      <value-group caption="ADMA Error Interrupt Signal Enable bit" name="SDHCINTSEN__ADEISE">
         <value caption="ADMA error signal is enabled" name="" value="0x1" />
         <value caption="ADMA error signal is masked" name="" value="0x0" />
      </value-group>
      <value-group caption="Auto CMD12 Not Executed bit" name="SDHCSTAT2__ACNEXEC">
         <value caption="Auto CMD12 was not executed" name="" value="0x1" />
         <value caption="Auto CMD12 was executed" name="" value="0x0" />
      </value-group>
      <value-group caption="Auto CMD12 Time-out Error bit" name="SDHCSTAT2__ACTOE">
         <value caption="Time-out error was generated" name="" value="0x1" />
         <value caption="Time-out error was not generated" name="" value="0x0" />
      </value-group>
      <value-group caption="Auto CMD12 CRC Error bit" name="SDHCSTAT2__ACCRCE">
         <value caption="CRC error was generated" name="" value="0x1" />
         <value caption="CRC error was not generated" name="" value="0x0" />
      </value-group>
      <value-group caption="Auto CMD12 End Bit Error bit" name="SDHCSTAT2__ACEBE">
         <value caption="End bit error was generated" name="" value="0x1" />
         <value caption="End bit error was not generated" name="" value="0x0" />
      </value-group>
      <value-group caption="Auto CMD12 Index Error bit" name="SDHCSTAT2__ACIDXE">
         <value caption="Index error was generated" name="" value="0x1" />
         <value caption="Index error was not generated" name="" value="0x0" />
      </value-group>
      <value-group caption="Command Not Issued by Auto CMD12 Error bit" name="SDHCSTAT2__CNISSE">
         <value caption="Command was not issued" name="" value="0x1" />
         <value caption="No error" name="" value="0x0" />
      </value-group>
      <value-group caption="Time-out Clock Frequency bits" name="SDHCCAP__TOCLKFREQ">
         <value caption="63 kHz or 63 MHz" name="" value="0x7e0" />
         <value caption="62 kHz or 62 MHz" name="" value="0x7c0" />
         <value caption="61 kHz or 61 MHz" name="" value="0x7a0" />
         <value caption="2 kHz or 2 MHz" name="" value="0x40" />
         <value caption="1 kHz or 1 MHz" name="" value="0x20" />
         <value caption="Reserved" name="" value="0x0" />
      </value-group>
      <value-group caption="Time-out Clock Unit bit" name="SDHCCAP__TOCLKU">
         <value caption="Time-out clock unit is in kHz" name="" value="0x1" />
         <value caption="Time-out clock unit is in MHz" name="" value="0x0" />
      </value-group>
      <value-group caption="Base Clock Frequency for SDCLK bits" name="SDHCCAP__BASECLK">
         <value caption="63 MHz" name="" value="0x3f" />
         <value caption="62 MHz" name="" value="0x3e" />
         <value caption="61 MHz" name="" value="0x3d" />
         <value caption="2 MHz" name="" value="0x2" />
         <value caption="1 MHz" name="" value="0x1" />
         <value caption="Reserved" name="" value="0x0" />
      </value-group>
      <value-group caption="Maximum Block Length bits" name="SDHCCAP__MBLEN">
         <value caption="Reserved" name="" value="0x0" />
         <value caption="2048" name="" value="0x0" />
         <value caption="1024" name="" value="0x0" />
         <value caption="512" name="" value="0x0" />
      </value-group>
      <value-group caption="ADMA2 Support bit" name="SDHCCAP__ADMA2">
         <value caption="ADMA2 is supported" name="" value="0x0" />
         <value caption="ADMA2 is not supported" name="" value="0x0" />
      </value-group>
      <value-group caption="High-speed Support bit" name="SDHCCAP__HISPEED">
         <value caption="High speed is supported" name="" value="0x0" />
         <value caption="High speed is not supported" name="" value="0x0" />
      </value-group>
      <value-group caption="Suspend/Resume Support bit" name="SDHCCAP__SRESUME">
         <value caption="Suspend/resume is supported" name="" value="0x0" />
         <value caption="Suspend/resume is not supported" name="" value="0x0" />
      </value-group>
      <value-group caption="3.3V Voltage Support bit" name="SDHCCAP__VOLT3V3">
         <value caption="Voltage of 3.3V is supported" name="" value="0x0" />
      </value-group>
      <value-group caption="Maximum Current for 3.3V bits" name="SDHCMAXCAP__MC3V3">
         <value caption="1020 mA" name="" value="0xff" />
         <value caption="1016 mA" name="" value="0xfe" />
         <value caption="1012 mA" name="" value="0xfd" />
         <value caption="12 mA" name="" value="0x3" />
         <value caption="8 mA" name="" value="0x2" />
         <value caption="4 mA" name="" value="0x1" />
         <value caption="Reserved" name="" value="0x0" />
      </value-group>
      <value-group caption="Force Event for Auto CMD12 Not Executed Error bit" name="SDHCFE__FEACNEE">
         <value caption="Interrupt was generated" name="" value="0x1" />
         <value caption="Interrupt was not generated" name="" value="0x0" />
      </value-group>
      <value-group caption="Force Event for Auto CMD12 Time-out Error bit" name="SDHCFE__FEACTOE">
         <value caption="Interrupt was generated" name="" value="0x1" />
         <value caption="Interrupt was not generated" name="" value="0x0" />
      </value-group>
      <value-group caption="Force Event for Auto CMD12 End Bit Error bit" name="SDHCFE__FEACEBE">
         <value caption="Interrupt was generated" name="" value="0x1" />
         <value caption="Interrupt was not generated" name="" value="0x0" />
      </value-group>
